load-test.yml
# load-test.yml

config:
  target: "http://localhost:3000"
  phases:
    - name: "ramp-up"
      duration: 60
      arrivalRate: 1
      rampTo: 40
    - name: "steady-state"
      duration: 120
      arrivalRate: 40
    - name: "ramp-down"
      duration: 30
      arrivalRate: 40
      rampTo: 0

  # Подключаем плагин и настраиваем endpoint-метрики
  plugins:
    metrics-by-endpoint:
      host: "0.0.0.0" 
      port: 9466              # HTTP-порт для Prometheus scrape
      include:
        - "/api/auth/register"
        - "/api/auth/login"
        - "/api/auth/me"
      # по умолчанию собираются: count, errors, latency (p50, p95)

  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Регистрация → Логин → Профиль"
    flow:
      - think: 2
      - post:
          url: "/api/auth/register"
          json:
            email: "user_{{ $processIndex }}_{{ $randomInt(1,100000) }}@test.local"
            password: "Password123!"
      - think: 1
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ lastRequest.json.email }}"
            password: "Password123!"
          capture:
            as: authToken
            json: $.token
      - think: 1
      - get:
          url: "/api/auth/me"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - think: 2